var station_map = new Object();
MapMode = "gas";
//检索POI
function mapSearch() {
	// 将检索到结果作为标点添加到地图中
	var searchObj = new plus.maps.Search(map);
	searchObj.onPoiSearchComplete = function(state, result) {
		console.log("onPoiSearchComplete: " + state + " , " + result.currentNumber);
		if (state == 0) {
			if (result.currentNumber <= 0) {
				alert("没有检索到结果");
			}
			for (var i = 0; i < result.currentNumber; i++) {
				var pos = result.getPosition(i);
				var marker = new plus.maps.Marker(pos.point);
				//marker.setLabel(pos.name);

				/*alert(pos.name);
				alert(pos.point.getLat());
				alert(pos.phone);
				alert(pos.city);
				alert(pos.postcode); */
				createMarkerfromBDPOI(pos, "百度POI", "marker_red.png")

				//map.addOverlay(marker);
			}
		} else {
			alert("检索POI失败");
		}
	}

	//110.30406,25.283552
	var pt = new plus.maps.Point(110.30406, 25.283552); //搜索中心点

	// 获取用户的当前位置信息 
	map.getUserLocation(function(state, point) {
		if (0 == state) {
			pt = point;
			console.log("定位")
		} else {
			alert("获取用户的当前位置失败!");
		}
	});
	searchObj.poiSearchNearBy("加油站", pt, 5000);
}
//检索路线
function transitSearch(start, end) {

	var searchObj = new plus.maps.Search(map);
	searchObj.onRouteSearchComplete = function(state, result) {
		var waitingwv = null;
		waitingwv = plus.nativeUI.showWaiting("正在查询中，请等待...", {
			loading: {
				/*icon: "../images/loading/big_loading.gif"*/
			}
		});

		console.log("onRouteSearchComplete: " + state + " ," + " ," + result.routeNumber);
		if (state == 0) {
			//alert("state == 0");
			if (result.routeNumber <= 0) {
				mui.toast("没有检索到结果");
				waitingwv.close();
				return;
			}
			//alert(result.routeNumber + "条路线");

			if (result.routeNumber > 0) {
				
				map.clearOverlays();
				setTimeout(function() {
				 
					map.addOverlay(result.getRoute(0)); 
				}, 300);
			 
				 
				waitingwv.close();
			}

			/*for (var i = 0; i < result.routeNumber; i++) {
				map.addOverlay(result.getRoute(i));
				console.log("onRouteSearchComplete2: " + JSON.stringify(result.getRoute(i)) );
			}*/
		} else {
			mui.toast("检索路线失败");
			waitingwv.close();
		}
	}

	//searchObj.transitSearch( "天安门", "大钟寺", "北京" );
	//searchObj.transitSearch( "桂林电子科技大学金鸡岭校区", "桂林站", "桂林" );
	//searchObj.drivingSearch( "桂林电子科技大学金鸡岭校区", "桂林", "桂林站", "桂林"  );
	searchObj.drivingSearch(start, "桂林", end, "桂林");

	//searchObj.transitSearch( "文景小区北门", "文化广场", "河源" );
	//searchObj.transitSearch("广东省河源市源城区红星西路128-4号", "广东省河源市源城区沿江东路1号", "河源");
}
//路线对象
function createRoute() {
	var routeObj = new plus.maps.Route(new plus.maps.Point(114.70548, 23.75608), new plus.maps.Point(114.712038, 23.764167));
	alert(routeObj.startPoint);
	alert(routeObj.endPoint.toString());
	alert(routeObj.pointCount);
	alert(routeObj.distance);
	alert(rrouteObj.routeTip);

	map.addOverlay(routeObj);
	//alert(routeObj.pointCount);
	//alert(routeObj.pointList);
}

//创建地标
function createMarkers(lng, lat,lable) {
	//高德地图坐标为(116.3406445236,39.9630878208), 百度地图坐标为(116.347292,39.968716
	var marker = new plus.maps.Marker(new plus.maps.Point(lng, lat));
	marker.setIcon("../images/map/search_icon2.png");
	console.log(lable);
	//marker.setLabel(lable);  
	var bubble = new plus.maps.Bubble(lable);

	marker.setBubble(bubble);
	map.addOverlay(marker); //addOverlay: 向地图中添加覆盖物
}
// 创建子窗口
function createSubview() {
	// 创建加载内容窗口
	var topoffset = '44px';
	if (plus.navigator.isImmersedStatusbar()) { // 兼容immersed状态栏模式
		topoffset = (Math.round(plus.navigator.getStatusbarHeight()) + 44) + 'px';
	}

	//路况
	var wsub = plus.webview.create('map_controls.html', 'sub', {
		/*top: topoffset,*/
		height: '130px',
		width: '39px',
		position: 'absolute',
		right: '5%',
		top: '10%',
		scrollIndicator: 'none',
		background: 'transparent',
		hardwareAccelerated :false
	});
	ws.append(wsub);
	//缩放控件
	var wsub2 = plus.webview.create('map_controls2.html', 'sub', {

		height: '93px',
		width: '58px',
		position: 'absolute',
		left: '5%',
		bottom: '20px',// '5%',
		scrollIndicator: 'none',
		background: 'transparent',
		hardwareAccelerated :false
	});
	ws.append(wsub2);
	//开关控件
 	var wsub_switch = plus.webview.create('map_controls_switch.html', 'map_controls_switch', {

		height: '119px',
		width: '81px',
		position: 'absolute',
		right: '5%',
		bottom: '20px',
		scrollIndicator: 'none' ,
		background: 'transparent' ,
		hardwareAccelerated :false
	});
	ws.append(wsub_switch);
/*	var wsub_route = plus.webview.create('map_controls_route.html', 'map_controls_route', {

		height: '93px',
		width: '58px',
		position: 'absolute',
		right: '5%',
		bottom: '30px',
		scrollIndicator: 'none',
		background: 'transparent'
	});
	ws.append(wsub_route);*/
	

}
 
//重置
function resetMap() {
	//map.centerAndZoom(pcenter,12);
	/*	var mapdiv = document.getElementById("map");
					alert(mapdiv.innerHTML);
					mapdiv.innerHTML += "<button type=\"button\" class=\"mui-btn\">*</button>";
					alert(mapdiv.innerHTML);*/

	map.reset();
}
//显示用户位置
function userLocation() {
	map.showUserLocation(true);
	map.getUserLocation(function(state, pos) {
		if (0 == state) {
			map.setCenter(pos);
			map.reset();
			//alert( JSON.stringify(pos) );
		}
	});
}
//创建附近加油站地标
function createOilMarker() {

	/*mui.ajax('http://apis.juhe.cn/oil/region?city=%E6%A1%82%E6%9E%97&keywords=%E6%B2%B9&page=1&format=1&key=9a6b0ab4e8eabf46c7e1beb7c34d96c3',{
	 
	dataType:'json',//服务器返回json格式数据
	type:'get',//HTTP请求类型
	timeout:10000,//超时时间设置为10秒；
	success:function(data){
		 alert(data.data[lon]);
		 createMarker(data.data[lon],data.data[lat])
	},
	error:function(xhr,type,errorThrown){
		//异常处理；
		console.log(type);
	}
});
	mui.get('http://club.jd.com/productpage/p-100012-s-3-t-3-p-0.html', 
		 
		function(data) {
			alert(data);
			alert(data.data);
			alert(data.data[lon]);
		}, 'json'
	);*/
	//河源
	//var data = JSON.parse('{"resultcode":"200","reason":"Return Successd!","result":{"data":[{"id":"3515","name":"中石化热水服务区加油站(南)","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县长深高速热水服务区内南侧","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.749799,23.822852","lon":"114.75629533444","lat":"23.828855018152","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,餐饮,卫生间,银联卡充值,加油卡充值业务"},{"id":"3516","name":"中石化热水服务区加油站(南)","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县阿深高速公路热水服务区内南侧","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.749799,23.822867","lon":"114.75629531924","lat":"23.828870014995","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,餐饮,卫生间"},{"id":"3517","name":"中石化热水服务区加油站(北)","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县长深高速热水服务区内北侧","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.748871,23.824084","lon":"114.7553626218","lat":"23.830103475325","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,餐饮,卫生间,银联卡充值,加油卡充值业务"},{"id":"3518","name":"中石化热水服务区加油站(北)","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县阿深高速公路热水服务区内北侧","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.748799,23.824057","lon":"114.75529037992","lat":"23.830077776294","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,餐饮,卫生间"},{"id":"3519","name":"中石化惠州油库加油站","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县205国道徐洞桥段,路西北侧","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.760714,23.813145","lon":"114.76725888588","lat":"23.818963262613","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"3520","name":"中油BP河源港连加油站","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县仙塘镇徐洞村前3公里,中肥农资河源公司对面方向","brandname":"中油BP","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.761024,23.812705","lon":"114.7675702825","lat":"23.818518641932","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"3521","name":"中石化仙塘加油站","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县仙塘镇g205路段","brandname":"中石化","type":"直营店","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.767578,23.820878","lon":"114.77413397205","lat":"23.826603805727","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"3522","name":"中石化新河加油站","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县205国道与阿深高速入口处附近","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.730697,23.802161","lon":"114.73715224905","lat":"23.808455867947","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"3559","name":"中石化紫金城南加油站","area":"517400","areaname":"广东省 河源市 紫金县","address":"广东省河源市紫金紫城镇城南s120路段","brandname":"中石化","type":"直营店","discount":"打折加油站","exhaust":"国Ⅲ","position":"115.187973,23.628508","lon":"115.19440462075","lat":"23.634785004567","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"3560","name":"中石化城东加油站","area":"517400","areaname":"广东省 河源市 紫金县","address":"广东省河源市紫金乌石镇城东120省道与东风路交汇处的东方，路北","brandname":"中石化","type":"直营店","discount":"打折加油站","exhaust":"国Ⅲ","position":"115.199917,23.630587","lon":"115.2063368384","lat":"23.636930694829","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"3561","name":"中石化紫金中心加油站","area":"517400","areaname":"广东省 河源市 紫金县","address":"广东省河源市紫金县竹园镇新紫路，城西村村委会对面","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"115.162784,23.632946","lon":"115.16930308203","lat":"23.638817096702","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,发卡充值网点,加油卡充值业务"},{"id":"4190","name":"中石油河源江东二号加油站","area":"517000","areaname":"广东省 河源市 源城区","address":"广东省河源市源城区东环路与紫河路交叉路口,向南,路西","brandname":"中石油","type":"直营店","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.7120326777,23.7074725147","lon":"114.724746","lat":"23.71989","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"银联卡,信用卡支付,加油卡,便利店,发卡充值网点,银联卡充值,加油卡充值业务"},{"id":"4191","name":"中石化明珠加油站","area":"517000","areaname":"广东省 河源市 源城区","address":"广东省河源市源城区湛珠湖，河源大道南新兴派出所附近","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.696368,23.717345","lon":"114.70282927198","lat":"23.723454421765","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05"},"fwlsmc":"加油卡"},{"id":"4192","name":"中油BP河源风光加油站","area":"517000","areaname":"广东省 河源市 源城区","address":"广东省河源市源城区河源大道南王虎排牙路段,路西","brandname":"中油BP","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.6895137147,23.7054859715","lon":"114.702369","lat":"23.717638","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"银联卡,信用卡支付,加油卡,便利店"},{"id":"4193","name":"中石化南门加油站","area":"517000","areaname":"广东省 河源市 源城区","address":"广东省河源市源城区南门岗，南门路与g205交叉路西","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.69441,23.72782","lon":"114.70087425107","lat":"23.733894721606","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"4194","name":"中石化南方加油站","area":"517000","areaname":"广东省 河源市 源城区","address":"广东省河源市源城区河源大道南100号,源城区人民医院附近","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.690997,23.731518","lon":"114.69747376185","lat":"23.737531913646","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,银联卡充值,加油卡充值业务"},{"id":"4285","name":"中石化顺天加油站","area":"517500","areaname":"广东省 河源市 东源县","address":"广东省河源市东源县顺天镇","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.776574,24.104801","lon":"114.78313116984","lat":"24.110459258692","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡"},{"id":"4580","name":"中石化临江加油站","area":"517400","areaname":"广东省 河源市 紫金县","address":"广东省河源市紫金县临江镇242省道烟坪路段,新湖酒店附近","brandname":"中石化","type":"其他","discount":"打折加油站","exhaust":"国Ⅲ","position":"114.7437245259,23.6808934151","lon":"114.757046","lat":"23.693218","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,便利店,发卡充值网点,银联卡充值,加油卡充值业务"},{"id":"5680","name":"中石油新紫路加油站","area":"517400","areaname":"广东省 河源市 紫金县","address":"广东省河源市紫金县新紫路与杨西路交叉口西,附城中学附近","brandname":"中石油","type":"其他","discount":"非打折加油站","exhaust":"国Ⅲ","position":"115.1579982883,23.6313995533","lon":"115.16453114946","lat":"23.63719515634","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","0#车柴":"5.35"},"fwlsmc":"加油卡"},{"id":"5851","name":"中石化龙母加油站","area":"517300","areaname":"广东省 河源市 龙川县","address":"广东省河源市龙母镇洋田s227路段","brandname":"中石化","type":"直营店","discount":"打折加油站","exhaust":"国Ⅲ","position":"115.425973,24.269641","lon":"115.43243852965","lat":"24.275902121281","price":{"E90":"6.2","E93":"5.58","E97":"6.05","E0":"5.15"},"gastprice":{"92#":"5.58","95#":"6.05","0#车柴":"5.15"},"fwlsmc":"加油卡,发卡充值网点"}],"pageinfo":{"pnums":20,"current":"1","allpage":7}},"error_code":0}');
	//桂林
	//var data = JSON.parse('{"resultcode":"200","reason":"Return Successd!","result":{"data":[{"id":"580","name":"中石化大律加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"广西壮族自治区桂林市临桂县306省道大律村路段路东","brandname":"中石化","type":"直营店","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.1783332224,25.2229748732","lon":"110.191577","lat":"25.235287","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,发卡充值网点,卫生间,加油卡充值业务"},{"id":"581","name":"中石油南路加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"广西壮族自治区桂林市临桂县万福路与306省道交汇处向南路西","brandname":"中石油","type":"其他","discount":"打折加油站","exhaust":"国Ⅳ","position":"110.167616861,25.2220269786","lon":"110.18025","lat":"25.234745","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"银联卡,信用卡支付,加油卡,便利店,卫生间,加油卡充值业务,银行ATM机"},{"id":"1799","name":"中石油南环加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西壮族自治区桂林市象山区凯风路与环城南二路交叉口向东路南","brandname":"中石油","type":"其他","discount":"打折加油站","exhaust":"国Ⅳ","position":"110.2885230624,25.2204942063","lon":"110.301568","lat":"25.232987","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"银联卡,信用卡支付,加油卡,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"1800","name":"中石化净瓶山加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西壮族自治区桂林市象山区瓦窑东路与环城南二路交叉口向东路南","brandname":"中石化","type":"直营店","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.2965861363,25.2218487505","lon":"110.310006","lat":"25.234422","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"1801","name":"中石化瓦窑加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西壮族自治区桂林市象山区同心路与崇信路交汇处","brandname":"中石化","type":"直营店","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.2860824631,25.2302780381","lon":"110.299334","lat":"25.24326","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,发卡充值网点,银联卡充值"},{"id":"1802","name":"中石化捷利加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西桂林市象山区凯风路88号，南泉路与321国道交叉处向北，路东","brandname":"中石化","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.287614,25.214422","lon":"110.29405765127","lat":"25.22072997125","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":"加油卡"},{"id":"1803","name":"久久加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西桂林市象山区相人山路号，相人山路与万福路交叉处向北，路东","brandname":"社会民营","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.274806,25.213857","lon":"110.28124607511","lat":"25.220178623555","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":""},{"id":"1804","name":"中石化桂林西环加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西壮族自治区桂林市象山区环城西一路35号,联达雅居附近","brandname":"中石化","type":"直营店","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.2744029654,25.2384875622","lon":"110.287116","lat":"25.251085","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"1805","name":"中石油长虹加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西壮族自治区桂林市象山区凯风路与长虹中路交叉口东北角","brandname":"中石油","type":"其他","discount":"打折加油站","exhaust":"国Ⅳ","position":"110.2817164566,25.1975688618","lon":"110.294983","lat":"25.210588","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":"加油卡"},{"id":"1806","name":"中石化迎宾加油站","area":"541002","areaname":"广西 桂林市 象山区","address":"广西桂林市象山区凯风路与长虹西路交叉口西南角","brandname":"中石化","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.287442,25.20364","lon":"110.29387575018","lat":"25.209946904046","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"4076","name":"中石油桂发加油站","area":"450321","areaname":"广西 桂林市 阳朔县","address":"广西壮族自治区桂林市阳朔县白沙镇321国道白沙堡路段路东","brandname":"中石油","type":"直营店","discount":"打折加油站","exhaust":"国Ⅳ","position":"110.4567553748,24.7849768544","lon":"110.469972","lat":"24.796583","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"4077","name":"中石化阳朔加油站","area":"450321","areaname":"广西 桂林市 阳朔县","address":"广西壮族自治区桂林市阳朔县蟠桃路126号,阳朔县妇幼保健院以西方向","brandname":"中石化","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.483324,24.774353","lon":"110.48985514059","lat":"24.780240760288","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36","E93#":"5.78"},"fwlsmc":"银联卡,加油卡"},{"id":"8467","name":"中石化顺风加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"广西省壮族自治区桂林市临桂县鲁山路与机场路交叉路口向西,路南","brandname":"中石化","type":"直营店","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.1869365908,25.2574424571","lon":"110.196847","lat":"25.269489","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,加油卡充值业务"},{"id":"8468","name":"中石化临桂西城加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"广西壮族自治区桂林市临桂县金水路路北,佳兴大厦附近","brandname":"中石化","type":"直营店","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.218053,25.250431","lon":"110.22463772154","lat":"25.25610420767","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36","E97#":"6.24"},"fwlsmc":"银联卡,加油卡"},{"id":"8469","name":"中石化临桂加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"广西壮族自治区桂林市临桂县东边山,金水路与鲁山路交汇处附近","brandname":"中石化","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.2161015168,25.2530634097","lon":"110.229623","lat":"25.264532","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"8470","name":"中石化桂林服务区加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"广西壮族自治区桂林市临桂县包茂高速桂林服务区西侧","brandname":"中石化","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.1186053088,25.2324012911","lon":"110.132076","lat":"25.244294","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,餐饮,卫生间"},{"id":"8471","name":"中石油西郊加油站","area":"541003","areaname":"广西 桂林市 秀峰区","address":"广西壮族自治区桂林市秀峰区翠竹路熊家路段路北,颐景园附近","brandname":"中石油","type":"其他","discount":"打折加油站","exhaust":"国Ⅳ","position":"110.2295741871,25.2548171383","lon":"110.24244","lat":"25.266216","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.36"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"8472","name":"中石化八里街加油站(自助站)","area":"541213","areaname":"广西 桂林市 灵川县","address":"广西壮族自治区桂林市灵川县八里四路与灵川大道交叉口南侧路西","brandname":"中石化","type":"直营店","discount":"打折加油站","exhaust":"国Ⅳ","position":"110.2996443656,25.3381132348","lon":"110.312395","lat":"25.35033","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","97#":"6.24","0#车柴":"5.33"},"fwlsmc":"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务"},{"id":"8473","name":"漓江石油加油站","area":"541111","areaname":"广西 桂林市 临桂县","address":"桂林市临桂县庙岭镇G321国道","brandname":"中石油","type":"其他","discount":"打折加油站","exhaust":"国Ⅳ","position":"","lon":"110.19184516779","lat":"25.291928861174","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":""},{"id":"11043","name":"中石化东岭加油站","area":"450321","areaname":"广西 桂林市 阳朔县","address":"广西壮族自治区桂林市阳朔县阳朔镇东岭路木山榨路段路东","brandname":"中石化","type":"其他","discount":"非打折加油站","exhaust":"国Ⅳ","position":"110.508131,24.778464","lon":"110.51457213064","lat":"24.784733890596","price":{"E90":"5.11","E93":"5.48","E97":"5.92","E0":"5.06"},"gastprice":{"93#":"5.78","0#车柴":"5.36"},"fwlsmc":"加油卡,93#自助加油,柴油自助加油,发卡充值网点,卫生间,加油卡充值业务"}],"pageinfo":{"pnums":20,"current":1,"allpage":13}},"error_code":0}');
	//附近
	data = JSON.parse('{\"resultcode\":\"200\",\"reason\":\"Successed!\",\"result\":{\"data\":[{\"id\":\"28710\",\"name\":\"漓江加油站\",\"area\":\"541111\",\"areaname\":\"广西 桂林市 临桂县\",\"address\":\"广西桂林市临桂县琴潭路与巾山路交叉处\",\"brandname\":\"不详\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.240918,25.26174\",\"lon\":\"110.24745092165\",\"lat\":\"25.267588184702\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":9919},{\"id\":\"27789\",\"name\":\"五洲石油琴潭加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区，翠竹路南巷与黑山路交叉处向西，路南，翠竹路南巷西端\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.267734,25.257953\",\"lon\":\"110.2741754091\",\"lat\":\"25.26421836902\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":7448},{\"id\":\"1803\",\"name\":\"久久加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区相人山路号，相人山路与万福路交叉处向北，路东\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.274806,25.213857\",\"lon\":\"110.28124607511\",\"lat\":\"25.220178623555\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":9786},{\"id\":\"27790\",\"name\":\"中石化独山加油站\",\"area\":\"541003\",\"areaname\":\"广西 桂林市 秀峰区\",\"address\":\"广西省壮族自治区桂林市秀峰区飞凤路与甲山路交叉路口南\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2725856656,25.2812044122\",\"lon\":\"110.28591\",\"lat\":\"25.293861\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":5831},{\"id\":\"1804\",\"name\":\"中石化桂林西环加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区环城西一路35号,联达雅居附近\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2744029654,25.2384875622\",\"lon\":\"110.287116\",\"lat\":\"25.251085\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":6985},{\"id\":\"27788\",\"name\":\"中石化桂林铁西加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区铁西四巷与环城西二路交汇处路东\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2740564836,25.2610877882\",\"lon\":\"110.287138\",\"lat\":\"25.273751\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":5877},{\"id\":\"27567\",\"name\":\"八定加油站\",\"area\":\"541003\",\"areaname\":\"广西 桂林市 秀峰区\",\"address\":\"广西桂林市秀峰区定江镇莲花塘村，153乡道与166县道交叉处东侧\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.285923,25.333391\",\"lon\":\"110.29236319945\",\"lat\":\"25.339708962472\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":7739},{\"id\":\"1806\",\"name\":\"中石化迎宾加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区凯风路与长虹西路交叉口西南角\",\"brandname\":\"中石化\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.287442,25.20364\",\"lon\":\"110.29387575018\",\"lat\":\"25.209946904046\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":9994},{\"id\":\"1802\",\"name\":\"中石化捷利加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区凯风路88号，南泉路与321国道交叉处向北，路东\",\"brandname\":\"中石化\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.287614,25.214422\",\"lon\":\"110.29405765127\",\"lat\":\"25.22072997125\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡\",\"distance\":8964},{\"id\":\"1805\",\"name\":\"中石油长虹加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区凯风路与长虹中路交叉口东北角\",\"brandname\":\"中石油\",\"type\":\"其他\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2817164566,25.1975688618\",\"lon\":\"110.294983\",\"lat\":\"25.210588\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡\",\"distance\":9877},{\"id\":\"27568\",\"name\":\"中石化桂林九华加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区九华路与圣隆路交汇处向东路南\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2844872705,25.2961630848\",\"lon\":\"110.297549\",\"lat\":\"25.308572\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\",\"E97#\":\"6.24\"},\"fwlsmc\":\"加油卡\",\"distance\":5169},{\"id\":\"27612\",\"name\":\"中国航油民航安新加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区安新村，安新南路与民主路交叉处南侧\",\"brandname\":\"中国航油\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.292767,25.258334\",\"lon\":\"110.29920923252\",\"lat\":\"25.264594050829\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":5144},{\"id\":\"1801\",\"name\":\"中石化瓦窑加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区同心路与崇信路交汇处\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2860824631,25.2302780381\",\"lon\":\"110.299334\",\"lat\":\"25.24326\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,发卡充值网点,银联卡充值\",\"distance\":6650},{\"id\":\"28603\",\"name\":\"运通加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区中山北路与翊武路交汇处的西方，奥林峰大酒店附近\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.294429,25.29363\",\"lon\":\"110.30085462098\",\"lat\":\"25.299866469253\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":4494},{\"id\":\"1799\",\"name\":\"中石油南环加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区凯风路与环城南二路交叉口向东路南\",\"brandname\":\"中石油\",\"type\":\"其他\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2885230624,25.2204942063\",\"lon\":\"110.301568\",\"lat\":\"25.232987\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"银联卡,信用卡支付,加油卡,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":7410},{\"id\":\"1800\",\"name\":\"中石化净瓶山加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区瓦窑东路与环城南二路交叉口向东路南\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2965861363,25.2218487505\",\"lon\":\"110.310006\",\"lat\":\"25.234422\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":6823},{\"id\":\"27565\",\"name\":\"中石化公交北门加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区大河乡,气象路与中山北路交叉口向南路西\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.298606405,25.3132399031\",\"lon\":\"110.311335\",\"lat\":\"25.325546\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡\",\"distance\":5306},{\"id\":\"8472\",\"name\":\"中石化八里街加油站(自助站)\",\"area\":\"541213\",\"areaname\":\"广西 桂林市 灵川县\",\"address\":\"广西壮族自治区桂林市灵川县八里四路与灵川大道交叉口南侧路西\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2996443656,25.3381132348\",\"lon\":\"110.312395\",\"lat\":\"25.35033\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.33\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":7636},{\"id\":\"27564\",\"name\":\"中石化桂林乌石加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区东二环路与中山北路交汇处路西\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.3005182292,25.3159826706\",\"lon\":\"110.313423\",\"lat\":\"25.328205\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,发卡充值网点,银联卡充值\",\"distance\":5424},{\"id\":\"27566\",\"name\":\"加油站（北辰路）\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区北辰路与金河路交叉口北行，路东侧\",\"brandname\":\"不详\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.307122,25.331071\",\"lon\":\"110.31362126886\",\"lat\":\"25.337123130571\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":6264}],\"pageinfo\":{\"pnums\":20,\"current\":1,\"allpage\":2}},\"error_code\":0}');

	for (var i = 0; i < data.result.data.length; i++) {
		//alert(data.result.data[0]['lon']);
		//alert(data.result.data[0]['lat']);
		var ptObj = new plus.maps.Point(data.result.data[i]['lon'], data.result.data[i]['lat']);
		var icon = "location_buxiang_map.9.png";
		if (data.result.data[i]['brandname'] == "社会民营") {
			icon = "location_minying_map.9.png"
		} else if (data.result.data[i]['brandname'] == "中石化") {
			icon = "location_zsh_map.9.png";
		} else if (data.result.data[i]['brandname'] == "中国航油") {
			icon = "location_zghy_map.9.png";
		} else if (data.result.data[i]['brandname'] == "中石油") {
			icon = "location_zsy_map.9.png";
		} else if (data.result.data[i]['brandname'] == "国企") {
			icon = "location_guoqi_map.9.png";
		} else if (data.result.data[i]['brandname'] == "壳牌") {
			icon = "location_qiaopai_map.9.png";
		} else if (data.result.data[i]['brandname'] == "中化道达尔") {
			icon = "location_daodaer_map.9.png";
		} else if (data.result.data[i]['brandname'] == "中海油") {
			icon = "location_zhy_map.9.png";
		} else if (data.result.data[i]['brandname'] == "中油BP") {
			icon = "location_zhongyoubp_map.9.png";
		} else if (data.result.data[i]['brandname'] == "加德士") {
			icon = "location_jiadeshi_map.9.png";
		}
		createMarker(data.result.data[i], icon);

	}

}
//ajax请求创建附近加油站地标
function createOilMarker2(lon, lat) {

	mui.ajax('http://apis.juhe.cn/oil/local?lon=' + lon + '&lat=' + lat + '&r=3000&page=&format=&key=695d599d1174e806d3f308fdc5c463a1', {
		dataType: 'json', //服务器返回json格式数据
		type: 'get', //HTTP请求类型
		timeout: 10000, //超时时间设置为10秒；
		success: function(data) {
			//data = JSON.parse('{\"resultcode\":\"200\",\"reason\":\"Successed!\",\"result\":{\"data\":[{\"id\":\"28710\",\"name\":\"漓江加油站\",\"area\":\"541111\",\"areaname\":\"广西 桂林市 临桂县\",\"address\":\"广西桂林市临桂县琴潭路与巾山路交叉处\",\"brandname\":\"不详\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.240918,25.26174\",\"lon\":\"110.24745092165\",\"lat\":\"25.267588184702\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":9919},{\"id\":\"27789\",\"name\":\"五洲石油琴潭加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区，翠竹路南巷与黑山路交叉处向西，路南，翠竹路南巷西端\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.267734,25.257953\",\"lon\":\"110.2741754091\",\"lat\":\"25.26421836902\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":7448},{\"id\":\"1803\",\"name\":\"久久加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区相人山路号，相人山路与万福路交叉处向北，路东\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.274806,25.213857\",\"lon\":\"110.28124607511\",\"lat\":\"25.220178623555\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":9786},{\"id\":\"27790\",\"name\":\"中石化独山加油站\",\"area\":\"541003\",\"areaname\":\"广西 桂林市 秀峰区\",\"address\":\"广西省壮族自治区桂林市秀峰区飞凤路与甲山路交叉路口南\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2725856656,25.2812044122\",\"lon\":\"110.28591\",\"lat\":\"25.293861\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":5831},{\"id\":\"1804\",\"name\":\"中石化桂林西环加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区环城西一路35号,联达雅居附近\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2744029654,25.2384875622\",\"lon\":\"110.287116\",\"lat\":\"25.251085\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":6985},{\"id\":\"27788\",\"name\":\"中石化桂林铁西加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区铁西四巷与环城西二路交汇处路东\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2740564836,25.2610877882\",\"lon\":\"110.287138\",\"lat\":\"25.273751\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":5877},{\"id\":\"27567\",\"name\":\"八定加油站\",\"area\":\"541003\",\"areaname\":\"广西 桂林市 秀峰区\",\"address\":\"广西桂林市秀峰区定江镇莲花塘村，153乡道与166县道交叉处东侧\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.285923,25.333391\",\"lon\":\"110.29236319945\",\"lat\":\"25.339708962472\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":7739},{\"id\":\"1806\",\"name\":\"中石化迎宾加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区凯风路与长虹西路交叉口西南角\",\"brandname\":\"中石化\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.287442,25.20364\",\"lon\":\"110.29387575018\",\"lat\":\"25.209946904046\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":9994},{\"id\":\"1802\",\"name\":\"中石化捷利加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区凯风路88号，南泉路与321国道交叉处向北，路东\",\"brandname\":\"中石化\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.287614,25.214422\",\"lon\":\"110.29405765127\",\"lat\":\"25.22072997125\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡\",\"distance\":8964},{\"id\":\"1805\",\"name\":\"中石油长虹加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区凯风路与长虹中路交叉口东北角\",\"brandname\":\"中石油\",\"type\":\"其他\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2817164566,25.1975688618\",\"lon\":\"110.294983\",\"lat\":\"25.210588\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡\",\"distance\":9877},{\"id\":\"27568\",\"name\":\"中石化桂林九华加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区九华路与圣隆路交汇处向东路南\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2844872705,25.2961630848\",\"lon\":\"110.297549\",\"lat\":\"25.308572\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\",\"E97#\":\"6.24\"},\"fwlsmc\":\"加油卡\",\"distance\":5169},{\"id\":\"27612\",\"name\":\"中国航油民航安新加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西桂林市象山区安新村，安新南路与民主路交叉处南侧\",\"brandname\":\"中国航油\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.292767,25.258334\",\"lon\":\"110.29920923252\",\"lat\":\"25.264594050829\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":5144},{\"id\":\"1801\",\"name\":\"中石化瓦窑加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区同心路与崇信路交汇处\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2860824631,25.2302780381\",\"lon\":\"110.299334\",\"lat\":\"25.24326\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,发卡充值网点,银联卡充值\",\"distance\":6650},{\"id\":\"28603\",\"name\":\"运通加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区中山北路与翊武路交汇处的西方，奥林峰大酒店附近\",\"brandname\":\"社会民营\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.294429,25.29363\",\"lon\":\"110.30085462098\",\"lat\":\"25.299866469253\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":4494},{\"id\":\"1799\",\"name\":\"中石油南环加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区凯风路与环城南二路交叉口向东路南\",\"brandname\":\"中石油\",\"type\":\"其他\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2885230624,25.2204942063\",\"lon\":\"110.301568\",\"lat\":\"25.232987\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"银联卡,信用卡支付,加油卡,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":7410},{\"id\":\"1800\",\"name\":\"中石化净瓶山加油站\",\"area\":\"541002\",\"areaname\":\"广西 桂林市 象山区\",\"address\":\"广西壮族自治区桂林市象山区瓦窑东路与环城南二路交叉口向东路南\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2965861363,25.2218487505\",\"lon\":\"110.310006\",\"lat\":\"25.234422\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":6823},{\"id\":\"27565\",\"name\":\"中石化公交北门加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区大河乡,气象路与中山北路交叉口向南路西\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.298606405,25.3132399031\",\"lon\":\"110.311335\",\"lat\":\"25.325546\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡\",\"distance\":5306},{\"id\":\"8472\",\"name\":\"中石化八里街加油站(自助站)\",\"area\":\"541213\",\"areaname\":\"广西 桂林市 灵川县\",\"address\":\"广西壮族自治区桂林市灵川县八里四路与灵川大道交叉口南侧路西\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.2996443656,25.3381132348\",\"lon\":\"110.312395\",\"lat\":\"25.35033\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.33\"},\"fwlsmc\":\"加油卡,便利店,93#自助加油,柴油自助加油,97#自助加油,发卡充值网点,卫生间,银联卡充值,加油卡充值业务\",\"distance\":7636},{\"id\":\"27564\",\"name\":\"中石化桂林乌石加油站\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区东二环路与中山北路交汇处路西\",\"brandname\":\"中石化\",\"type\":\"直营店\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.3005182292,25.3159826706\",\"lon\":\"110.313423\",\"lat\":\"25.328205\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"97#\":\"6.24\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"加油卡,便利店,发卡充值网点,银联卡充值\",\"distance\":5424},{\"id\":\"27566\",\"name\":\"加油站（北辰路）\",\"area\":\"541001\",\"areaname\":\"广西 桂林市 叠彩区\",\"address\":\"广西壮族自治区桂林市叠彩区北辰路与金河路交叉口北行，路东侧\",\"brandname\":\"不详\",\"type\":\"其他\",\"discount\":\"非打折加油站\",\"exhaust\":\"国Ⅳ\",\"position\":\"110.307122,25.331071\",\"lon\":\"110.31362126886\",\"lat\":\"25.337123130571\",\"price\":{\"E90\":\"5.24\",\"E93\":\"5.62\",\"E97\":\"6.07\",\"E0\":\"5.19\"},\"gastprice\":{\"93#\":\"5.78\",\"0#车柴\":\"5.36\"},\"fwlsmc\":\"\",\"distance\":6264}],\"pageinfo\":{\"pnums\":20,\"current\":1,\"allpage\":2}},\"error_code\":0}');
			console.log(JSON.stringify(data));
			for (var i = 0; i < data.result.data.length; i++) { 
				//alert(data.result.data[0]['lon']);
				//alert(data.result.data[0]['lat']);
				//var ptObj = new plus.maps.Point(data.result.data[i]['lon'], data.result.data[i]['lat']);

				if (station_map[data.result.data[i]['id']] == null || station_map[data.result.data[i]['id']] == undefined) {

					station_map[data.result.data[i]['id']] = "1";
					
					
				 	var icon = "";
					if(mui.os.android)
					{
						icon = "location_buxiang_map.9.png";
						if (data.result.data[i]['brandname'] == "社会民营") {
							icon = "location_minying_map.9.png"
						} else if (data.result.data[i]['brandname'] == "中石化") {
							icon = "location_zsh_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中国航油") {
							icon = "location_zghy_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中石油") {
							icon = "location_zsy_map.9.png";
						} else if (data.result.data[i]['brandname'] == "国企") {
							icon = "location_guoqi_map.9.png";
						} else if (data.result.data[i]['brandname'] == "壳牌") {
							icon = "location_qiaopai_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中化道达尔") {
							icon = "location_daodaer_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中海油") {
							icon = "location_zhy_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中油BP") {
							icon = "location_zhongyoubp_map.9.png";
						} else if (data.result.data[i]['brandname'] == "加德士") {
							icon = "location_jiadeshi_map.9.png";
						}
					}
					else{
						icon = "ios_location_buxiang_map.9.png";
						if (data.result.data[i]['brandname'] == "社会民营") {
							icon = "ios_location_minying_map.9.png"
						} else if (data.result.data[i]['brandname'] == "中石化") {
							icon = "ios_location_zsh_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中国航油") {
							icon = "ios_location_zghy_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中石油") {
							icon = "ios_location_zsy_map.9.png";
						} else if (data.result.data[i]['brandname'] == "国企") {
							icon = "ios_location_guoqi_map.9.png";
						} else if (data.result.data[i]['brandname'] == "壳牌") {
							icon = "ios_location_qiaopai_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中化道达尔") {
							icon = "ios_location_daodaer_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中海油") {
							icon = "ios_location_zhy_map.9.png";
						} else if (data.result.data[i]['brandname'] == "中油BP") {
							icon = "ios_location_zhongyoubp_map.9.png";
						} else if (data.result.data[i]['brandname'] == "加德士") {
							icon = "ios_location_jiadeshi_map.9.png";
						}
					}
					

					createMarker(data.result.data[i], icon);
				}
				/*else{
					alert(data.result.data[i]['name']+"已有");
				}*/

				//alert(station_map[data.result.data[i]['id']]);  

				//alert(station_map[data.result.data[i]['id']]);

				/*	{
						var aa= data.result.data[i]['name'];
						station_map.aa="1";
					}
					alert(station_map[data.result.data[i]['name']]);*/

			}

		},
		error: function(xhr, type, errorThrown) {
			//异常处理；
			console.log(type);
		}
	});
}

//创建地标 - 传对象（经纬度、地址、logo、加油站名称） 
function createMarker(station, icon) {
	//高德地图坐标为(116.3406445236,39.9630878208), 百度地图坐标为(116.347292,39.968716
	var marker = new plus.maps.Marker(new plus.maps.Point(station.lon, station.lat));

	markOnclice2center(marker, new plus.maps.Point(station.lon, station.lat),station); //设置点击的marker为中心
	console.log()
	marker.setIcon("../images/brand/" + icon);
	 //marker.setLabel("label");
	 
	 
	 
	//注释bubble
	/*var bubble = new plus.maps.Bubble(station.name);
	//bubble.loadImageDataURL(can.toDataURL("../images/helloh5.jpg"));

	var can = document.createElement('canvas');
	can.width = "465";

	var cxt = can.getContext("2d");

	//var img=document.getElementById("tulip");

	var img = new Image();
	img.src = "../images/dig.png";
	img.width = "465";

	var img2 = new Image();
	img2.src = "../images/map-marker-marker-inside-azure.png";



	img.onload = function() {
		//alert("img is loaded"); 
		//alert("img.width=" + img.width + "img.height=" + img.height);

		cxt.drawImage(img, 0, 17);
		cxt.drawImage(img2, 15, 70);
		//cxt.drawImage(img3, 15, 40);

		cxt.font = "italic 30px sans-serif";
		cxt.fillStyle = "#888888";
		cxt.textBaseline = 'top';
		cxt.fillText(station.name, 15, 30);

		cxt.font = "italic 24px sans-serif";
		cxt.fillText("地址：" + station.address, 45, 73);

		bubble.loadImageDataURL(can.toDataURL("../images/dig.png"));

		//cxt.drawImage(img2, 15, 80);
		//bubble.loadImageDataURL("data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAsCAYAAAAn4+taAAAABHNCSVQICAgIfAhkiAAAAAlwSFlzAAALEgAACxIB0t1+/AAAABZ0RVh0Q3JlYXRpb24gVGltZQAwNC8wMS8xNExYUU4AAAAcdEVYdFNvZnR3YXJlAEFkb2JlIEZpcmV3b3JrcyBDUzbovLKMAAACTklEQVRoge2YO2gUURSGv7PjEkULO4UoFooIFgtzprAPWMiWKewSTadgYWEhBjHCloGUQtYHaGEjGAQtUmgnZO9YpsqC2NgYIwjRInMscoPrYkzhGTIs8zdnzoP578ewM/eumBmjoMZ+L8BLNUjVVINUTTVI1VSDVE0jA3KgjJuGEE6LyI2iKC6JyBkzWxORF8ADVV0rw1O891ohhCngPnDyL+1PZjabZdkTV1OcQUIIV4CHMf0JvAK+A0eANjAWe1dV9ZGbMY6/kTzPzwHzMV0VkZaqTgLTqjopIi1gNfbnQwhnvbzBEcTMbgFHgXURaRdFsRFCWAa+hhCWi6LYEJE2sB7nbnp5g+9b62KMIU3Tvoh0gQm2Fz0hIt00TftAADCztqO3K8h4jJsAZnZ+sDmQ/wAQkXEc5QnyJcZjACLybLApIk/j5YmheRd5gryLMev1elOqesfMrpvZczO7pqqzvV5vGmgNzbvIDUREXsbLRES6IYTbzWZzMcuyy0mSPA4h3BWRxR3PgXkff6/vSJ7nx83sPXBqoLwJFEACHByofxSRC2mafnYxx/GJxEW9GSofAg7zJwTAa08I8N80doG9HrHx++vvJlcQVV0xs6V/zZjZkqquePpCOdv4OWBrl96WiNwrwdMfJMuyHFjYpb2gqh+8PaG8g9Uc0B+q9WO9FJUCoqrfgBm2X73EOBPrpai0o66qvgU6Me3EvDSVctTdUZIknaIoxhqNRmfv6f+T+1F3vzQy/6LUIFVTDVI11SBVUw1SNdUgVdPIgPwCtt+2JPQRVicAAAAASUVORK5CYII=");
		//alert(can.toDataURL("../images/orientationc.png")); 

	};
	marker.setBubble(bubble);
	// 用户点击气泡将弹出气泡上的标题信息 
	bubble.onclick = function(bubble2) {
		map.setCenter(new plus.maps.Point(station.lon, station.lat)); //设置点击中心
		//alert("Clicked:" + bubble2.getLabel());

		mui.openWindow({
			id: 'detail',
			url: 'map_gasStationDetail.html',
			extras: {
				entype: "map",
				datas: station
			},
			waiting: {
				autoShow: false
			}

			
		});

	}*/

	map.addOverlay(marker); //addOverlay: 向地图中添加覆盖物
}
//百度地图加油站
function createMarkerfromBDPOI(pos, label, icon) {
	//高德地图坐标为(116.3406445236,39.9630878208), 百度地图坐标为(116.347292,39.968716
	var marker = new plus.maps.Marker(new plus.maps.Point(pos.point.getLng(), pos.point.getLat()));

	markOnclice2center(marker, pos.point); //设置点击的marker为中心

	marker.setIcon("../images/" + icon);
	//marker.setLabel(label);
	var bubble = new plus.maps.Bubble(pos.name);
	//bubble.loadImageDataURL(can.toDataURL("../images/helloh5.jpg"));

	var can = document.createElement('canvas');
	can.width = "465";

	var cxt = can.getContext("2d");

	//var img=document.getElementById("tulip");

	var img = new Image();
	img.src = "../images/dig.png";
	img.width = "465";

	var img2 = new Image();
	img2.src = "../images/map-marker-marker-inside-azure.png";

	/*	var img3 = new Image();
		img3.src = "../images/jyz.png";*/

	img.onload = function() {
		//alert("img is loaded");
		//alert("img.width=" + img.width + "img.height=" + img.height);

		cxt.drawImage(img, 0, 17);
		cxt.drawImage(img2, 15, 70);
		//cxt.drawImage(img3, 15, 40);

		cxt.font = "italic 30px sans-serif";
		cxt.fillStyle = "#888888";
		cxt.textBaseline = 'top';
		cxt.fillText(pos.name, 15, 30);

		cxt.font = "italic 24px sans-serif";
		cxt.fillText("地址：" + pos.address, 45, 73);

		bubble.loadImageDataURL(can.toDataURL("../images/dig.png"));

		//cxt.drawImage(img2, 15, 80);
		//bubble.loadImageDataURL("data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAsCAYAAAAn4+taAAAABHNCSVQICAgIfAhkiAAAAAlwSFlzAAALEgAACxIB0t1+/AAAABZ0RVh0Q3JlYXRpb24gVGltZQAwNC8wMS8xNExYUU4AAAAcdEVYdFNvZnR3YXJlAEFkb2JlIEZpcmV3b3JrcyBDUzbovLKMAAACTklEQVRoge2YO2gUURSGv7PjEkULO4UoFooIFgtzprAPWMiWKewSTadgYWEhBjHCloGUQtYHaGEjGAQtUmgnZO9YpsqC2NgYIwjRInMscoPrYkzhGTIs8zdnzoP578ewM/eumBmjoMZ+L8BLNUjVVINUTTVI1VSDVE0jA3KgjJuGEE6LyI2iKC6JyBkzWxORF8ADVV0rw1O891ohhCngPnDyL+1PZjabZdkTV1OcQUIIV4CHMf0JvAK+A0eANjAWe1dV9ZGbMY6/kTzPzwHzMV0VkZaqTgLTqjopIi1gNfbnQwhnvbzBEcTMbgFHgXURaRdFsRFCWAa+hhCWi6LYEJE2sB7nbnp5g+9b62KMIU3Tvoh0gQm2Fz0hIt00TftAADCztqO3K8h4jJsAZnZ+sDmQ/wAQkXEc5QnyJcZjACLybLApIk/j5YmheRd5gryLMev1elOqesfMrpvZczO7pqqzvV5vGmgNzbvIDUREXsbLRES6IYTbzWZzMcuyy0mSPA4h3BWRxR3PgXkff6/vSJ7nx83sPXBqoLwJFEACHByofxSRC2mafnYxx/GJxEW9GSofAg7zJwTAa08I8N80doG9HrHx++vvJlcQVV0xs6V/zZjZkqquePpCOdv4OWBrl96WiNwrwdMfJMuyHFjYpb2gqh+8PaG8g9Uc0B+q9WO9FJUCoqrfgBm2X73EOBPrpai0o66qvgU6Me3EvDSVctTdUZIknaIoxhqNRmfv6f+T+1F3vzQy/6LUIFVTDVI11SBVUw1SNdUgVdPIgPwCtt+2JPQRVicAAAAASUVORK5CYII=");
		//alert(can.toDataURL("../images/orientationc.png")); 

	};
	marker.setBubble(bubble);
	// 用户点击气泡将弹出气泡上的标题信息 
	bubble.onclick = function(bubble2) {
		map.setCenter(new plus.maps.Point(pos.point.getLng(), pos.point.getLat())); //设置点击中心
		alert("Clicked:" + bubble2.getLabel());
		alert("poi:" + pos.point.getLat());

		mui.openWindow({
			id: 'detail',
			url: 'map_gasStationDetail.html',
			/*show: {
				autoShow: true, //页面loaded事件发生后自动显示，默认为true
				aniShow: 'slide-in-top', //'slide-in-top', //页面显示动画，默认为”slide-in-right“；
				duration: 100 //页面动画持续时间，Android平台默认100毫秒，iOS平台默认200毫秒；
			},*/
		});

	}

	map.addOverlay(marker); //addOverlay: 向地图中添加覆盖物
}
//用户点击地图事件
function mapOnclice() {
	//用户点击地图事件
	map.onclick = function(point) {
		//alert(JSON.stringify(point));
		//alert(point.getLng()); 

		createMarker(point, "点击", "flag.png");
		map.setCenter(point); //设置点击中心
	}
}
//用户点击地标事件
function markOnclice2center(mk, poi,station) {
	 
	//用户点击地标事件
	mk.onclick = function() {
		
		console.log((mk.getPoint().getLat())); 
		map.setCenter(new plus.maps.Point(poi.getLng(), poi.getLat())); //设置点击中心
		
		ws_tips=plus.webview.getWebviewById("map_tips");
		ws_tips2=plus.webview.getWebviewById("map_tips2");
		if(ws_tips==null&&ws_tips2==null)
		{
			openNewWindows('map_tips.html','map_tips',station);
			return;
		}
		if(ws_tips!=null)
		{ 
			console.log("ws_tips.close();")
			
			openNewWindows('map_tips.html','map_tips2',station);
			ws_tips.close(); 
			return;
				 
			
		}
		if(ws_tips2!=null)
		{ 
			console.log("ws_tips2.close();")
			
			openNewWindows('map_tips.html','map_tips',station);
			ws_tips2.close(); 
			return;
		}
		 
		
 
	}
}
function openNewWindows(path,id,station){
	console.log(JSON.stringify(station.name))
		console.log(JSON.stringify(station.address)) 
	mui.openWindow({
						url: path,
						id: id,
						show: {
							autoShow: true,
							aniShow: 'slide-in-bottom' 
							  
						},
						waiting: {
							autoShow: false
						},
						styles: {
							popGesture: 'hide',
							height:'155',
							bottom:'0'
						},
						extras: {
							/*name: station.name,
							address:station.address,*/
							station:station 
						}
					});
}

//获取位置点
function getPosition() {
	alert("11122");
	var posObj = new plus.maps.Position(new plus.maps.Point(110.343267, 25.286926));
	alert(posObj.point.getLat() + "," + posObj.point.getLng());
	alert(posObj.name);
	alert(posObj.city);
	alert(posObj.address);
	alert(posObj.postcode);
	var marker = new plus.maps.Marker(posObj.point);
	map.addOverlay(marker);

}
//交通控件
function trafficCon() {
	var traff = map.isTraffic();
	if (traff) {
		map.setTraffic(false); //设置是否显示交通信息图层
	} else {
		map.setTraffic(true); //设置是否显示交通信息图层
	}

}

//放大
function zoomIn() {
	var zoom = map.getZoom();
	/*	alert(zoom);*/
	zoom = zoom + 1;
	map.setZoom(zoom);
	/*	alert(map.getZoom());*/

}
//缩小
function zoomOut() {
	var zoom = map.getZoom();
	/*alert(zoom);*/
	zoom = zoom - 1;
	map.setZoom(zoom);
	/*alert(map.getZoom());*/

}
//加油站列表
function moreStation() {
	mui.openWindow({
		url: 'map_gasStation.html',
		id: 'map_gasStation.html',
		/*show: {
			aniShow: 'pop-in'
		},*/
		styles: {
			popGesture: 'hide',
			hardwareAccelerated: false
		},
		waiting: {
			autoShow: false
		}
	});
}

// 获取当前地图显示的地图中心点位置
function getCurrentCenter() {
	var pt1 = new plus.maps.Point();
	map.getCurrentCenter(function(state, point) {
		if (0 == state) {
			alert(JSON.stringify(point));

			pt1.setLng(point.getLng());
			pt1.setLat(point.getLat())
			alert(pt1 + "111111111");

		} else {
			alert("Failed!");
		}
	});
	return pt1;
}
//检索中心createMarkers
function createMarkerFromSearch(lng, lat,lable) {

	createMarkers(lng, lat,lable);
	createOilMarker2(lng,lat)
	map.setCenter(new plus.maps.Point(lng, lat)); //设置点击中心

}
//打开路线检索页面
function route() {

	mui.openWindow({
		url: 'map_navigation.html',
		id: 'map_navigation',
		/*	show: {
				aniShow: 'slide-in-bottom'
			},*/
		styles: {

			popGesture: 'hide',
			scrollIndicator: 'none',
			hardwareAccelerated: false

		},
		waiting: {
			autoShow: false
		}
	});

}
//画出路线
function getRoute() {

}
function setMapMode(mode) {
	MapMode = mode;
	if(mode=="gas"){
		   clearMap();
		   map.getCurrentCenter(function(state, point) {
						if (0 == state) {
							//map.clearOverlays();//清楚所有覆盖物 
							createOilMarker2(point.getLng(), point.getLat());
						} else {
							alert("Failed!");
						}
					});
	}
	else
	{
		clearMap();
	}
	console.log(MapMode)
}
function clearMap() {
	station_map = new Object(); 
	map.clearOverlays();//清楚所有覆盖物
}

//检索路线
function goto(endlng,endlat) {   
var start="";
start_lat="";
start_lng="";
var start_point = new plus.maps.Point( start_lng, start_lat );
var end_point = new plus.maps.Point( endlng, endlat );
plus.geolocation.getCurrentPosition( function ( p ) {
	start=p.poiName;
	start_point.setLat(p.coords.latitude);
	start_point.setLng(p.coords.longitude);
	
	console.log(JSON.stringify(p))
	console.log(JSON.stringify(p.addresses))
		//alert( "Geolocation\nLatitude:" + p.coords.latitude + "\nLongitude:" + p.coords.longitude + "\nAltitude:" + p.coords.altitude );
	console.log("ssss"+JSON.stringify(start_point)+ "桂林"+ JSON.stringify(end_point) + "桂林");
	searchObj.drivingSearch(start_point, "桂林", end_point, "桂林"); 	
 

}, function ( e ) {
		alert( "Geolocation error: " + e.message );
	} ); 

	var searchObj = new plus.maps.Search(map);
	searchObj.onRouteSearchComplete = function(state, result) {
		console.log("onRouteSearchComplete")
		var waitingwv = null;
		waitingwv = plus.nativeUI.showWaiting("正在查询中，请等待...", {
			loading: {
				/*icon: "../images/loading/big_loading.gif"*/
			}
		});

		console.log("onRouteSearchComplete: " + state + " ," + " ," + result.routeNumber);
		if (state == 0) {
			//alert("state == 0");
			if (result.routeNumber <= 0) {
				mui.toast("没有检索到结果");
				waitingwv.close();
				return;
			}
			//alert(result.routeNumber + "条路线");
			
			if (result.routeNumber > 0) {
				console.log("huaxian")
				map.clearOverlays();
				setTimeout(function() {
					console.log("huaxian300s")
					map.addOverlay(result.getRoute(0)); 
				}, 300);
				
				
				
				waitingwv.close();
			}

			/*for (var i = 0; i < result.routeNumber; i++) {
				map.addOverlay(result.getRoute(i));
				console.log("onRouteSearchComplete2: " + JSON.stringify(result.getRoute(i)) );
			}*/
		} else {
			mui.toast("检索路线失败");
			waitingwv.close();
		}
	}

	//searchObj.transitSearch( "天安门", "大钟寺", "北京" );
	//searchObj.transitSearch( "桂林电子科技大学金鸡岭校区", "桂林站", "桂林" );
	//searchObj.drivingSearch( "桂林电子科技大学金鸡岭校区", "桂林", "桂林站", "桂林"  );
	

	//searchObj.transitSearch( "文景小区北门", "文化广场", "河源" );
	//searchObj.transitSearch("广东省河源市源城区红星西路128-4号", "广东省河源市源城区沿江东路1号", "河源");
}